Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Select at least one of the options!
sv: Välj minst ett av alternativen!

source: Order by:
sv: Sorteringsordning:

source: Count
sv: Räkna

source: Tabs
sv: Flikar

source: Socket on which MySQL server is listening, leave empty for default.
sv: Sockel som MySQL-servern lyssnar på, lämna tomt för standardsocket.

source: Monitor Instructions
sv: Övervaka instruktioner

source: Name (Descending)
sv: Namn (fallande)

source: The maximum size of a data log file. The default value is 64MB. PBXT can create a maximum of 32000 data logs, which are used by all tables. So the value of this variable can be increased to increase the total amount of data that can be stored in the database.
sv: Maximal storlek för dataloggfil. Standardvärdet är 64MB. PBXT kan skapa maximalt 32000 dataloggar, som används av alla tabeller. Så denna variabels värde kan ökas för att öka den totala mängden data som kan lagras i databasen.

source: Enable two-factor authentication
sv: Aktivera tvåfaktorsautentisering

source: The routing cache could not be written, you need to adjust permissions on the folder/file "%s"
sv: Routningscachen kunde inte skrivas. Du behöver justera behörigheterna för mappen eller filen ”%s”.

source: Leave blank for no user preferences storage in database, suggested: [kbd]pma__userconfig[/kbd].
sv: Lämna tomt för att stänga av lagring av användarpreferenser i databasen, förslag: [kbd]pma__userconfig[/kbd].

source: Showing rows %1$s - %2$s.
sv: Visar raderna %1$s - %2$s.

source: Bookmark:
sv: Bokmärke:

source: CSV for MS Excel
sv: CSV för MS Excel

source: %d seconds
sv: %d sekunder

source: Both this table and the user groups table are required to enable the configurable menus feature; leaving either one of them blank will disable this feature, suggested: [kbd]pma__users[/kbd].
sv: Både denna tabell och användargruppstabellen behövs för att aktivera funktionen anpassningsbara menyer; om en av dem lämnas tom inaktiveras funktionen, förslag: [kbd]pma__users[/kbd].

source: Edit routine
sv: Redigera rutin

source: Reading of version failed. Maybe you're offline or the upgrade server does not respond.
sv: Lyckades ej läsa version. Du är kanske offline, eller så svarar inte uppgraderingsservern.

source: The number of bytes a script is allowed to allocate, e.g. [kbd]32M[/kbd] ([kbd]-1[/kbd] for no limit and [kbd]0[/kbd] for no change).
sv: Antal byte ett skript får allokera, t.ex. [kbd]32M[/kbd] ([kbd]-1[/kbd] för ingen begränsning och [kbd]0[/kbd] för ingen ändring).

source: The fullscreen request was denied because the Fullscreen API is disabled by user preference in the browser.
sv: Begäran om helskärmsläge nekades eftersom Fullscreen API är inaktiverat i webbläsarens användarinställningar.

source: Could not save favorite table!
sv: Kunde inte spara favorittabell!

source: Allows altering and dropping this routine.
sv: Tillåter att den här rutinen ändras eller tas bort.

source: Customize default options.
sv: Anpassa förvalda alternativ.

source: The number of queries that have been removed from the cache to free up memory for caching new queries. This information can help you tune the query cache size. The query cache uses a least recently used (LRU) strategy to decide which queries to remove from the cache.
sv: Antalet frågor som har tagits bort från cachen för att frigöra minne för cachning av nya frågor. Denna information kan hjälpa dig att ställa in storleken på frågecachen. Frågecachen använder strategin minst nyligen använd (LRU) för att bestämma vilka frågor som ska tas bort från cachen.

source: Divided by %s
sv: Dividerat med %s

source: Default server
sv: Förvald server

source: A double-precision floating-point number, allowable values are -1.7976931348623157E+308 to -2.2250738585072014E-308, 0, and 2.2250738585072014E-308 to 1.7976931348623157E+308
sv: Ett dubbel-precision flyttal. Tillåtna värden är: 1.7976931348623157E+308 till 2.2250738585072014E-308, 0, och 2.2250738585072014E-308 till 1.7976931348623157E+308

source: This usually indicates frequent full index scans. Full index scans are faster than table scans but require lots of CPU cycles in big tables, if those tables that have or had high volumes of UPDATEs and DELETEs, running 'OPTIMIZE TABLE' might reduce the amount of and/or speed up full index scans. Other than that full index scans can only be reduced by rewriting queries.
sv: Detta indikerar oftast frekventa fullständiga indexsökningar. Fullständiga indexsökningar är snabbare än tabellsökningar, men kräver mycket CPU-tid vid stora tabeller, om dessa tabeller har eller har haft stora volymer av UPDATES's och DELETE's, kan "OPTIMIZE TABLE" minska mängden och/eller snabba upp fullständiga indexsökningar. Fullständiga indexskanningar kan bara minskas genom att skriva om frågorna.

source: Start row:
sv: Startrad:

source: Browsing
sv: Bläddrar bland

source: Missing connection parameters!
sv: Anslutningsparametrar saknas!

source: Structure only
sv: Enbart struktur

source: Step 2.
sv: Steg 2.

source: Rate of reading first index entry
sv: Andel läsning av första indexpost

source: Edit event
sv: Redigera händelse

source: Character sets and collations
sv: Teckenuppsättningar och sorteringsordningar

source: File format to export
sv: Filformat att exportera

source: See table structure
sv: Se tabellstruktur

source: Allow logins without a password
sv: Tillåt inloggning utan lösenord

source: accent-insensitive
sv: Accentokänslig

source: Maximum displayed SQL length
sv: Maximal visad SQL-längd

source: Invalid table name
sv: Ogiltigt tabellnamn

source: General
sv: Allmänt

source: Insert as new row
sv: Lägg till som ny rad

source: Original length
sv: Ursprunglig längd

source: Rate of reading next table row
sv: Andelen av läsning av nästa tabellrad

source: Enable navigation tree expansion
sv: Aktivera trädexpansion i navigationspanelen

source: Table joins average: %s, this value should be less than 1 per hour
sv: Tabellkoppling i genomsnitt: %s detta värde bör vara mindre än 1 per timme

source: Formats text as SQL query with syntax highlighting.
sv: Formaterar text som en SQL-fråga med syntaxmarkering.

source: Do you really want to DROP the selected partition(s)? This will also DELETE the data related to the selected partition(s)!
sv: Vill du verkligen släppa valda partitionen/partitionerna? Detta tar också bort uppgifterna om den valda partitionen/partitionerna!

source: Please connect your WebAuthn/FIDO2 device. Then confirm registration on the device.
sv: Anslut WebAuthn/FIDO2-enheten. Bekräfta sedan registreringen på enheten.

source: Connection for controluser as defined in your configuration failed.
sv: Uppkoppling för kontrollanvändare enligt din konfiguration misslyckades.

source: Skip locked tables
sv: Hoppa över låsta tabeller

source: Exit fullscreen
sv: Avsluta helskärmsläge

source: Croatian
sv: Kroatisk

source: Invalid security key.
sv: Ogiltig säkerhetsnyckel.

source: Turkish
sv: Turkisk

source: If TRUE, logout deletes cookies for all servers; when set to FALSE, logout only occurs for the current server. Setting this to FALSE makes it easy to forget to log out from other servers when connected to multiple servers.
sv: Om TRUE raderas cookies för alla servrar vid utloggning; när satt till FALSE sker utloggning endast för aktuell server. Satt till FALSE gör det lätt att glömma att logga ut från andra servrar när du är ansluten till flera servrar.

source: Disable the default warning that is displayed on the database details Structure page if any of the required tables for the phpMyAdmin configuration storage could not be found.
sv: Inaktivera standardvarningar som visas på struktursidan under databasdetaljer om någon av de nödvändiga tabellerna för konfigurationslagring för phpMyAdmin inte kunde hittas.

source: Pie
sv: Cirkeldiagram

source: The number of physical writes to the log file.
sv: Antalet fysiska skrivningar till loggfilen.

source: New database name
sv: Nytt Databasnamn

source: Show last update timestamp
sv: Visa senaste uppdatering

source: UI preferences table
sv: Tabell för inställningar av användargränssnittet

source: Not enough privilege to view status variables.
sv: Inte tillräckliga privilegier för att visa status-variabler.

source: Invalid class name "%1$s", using default of "Node"
sv: Ogiltigt klassnamn "%1$s", använder standard "Node"

source: Check table
sv: Kontrollera tabell

source: The first step of normalization is complete for table '%s'.
sv: Det första steget av normalisering är klar för tabellen '%s'.

source: Errors occurred while executing rule expressions:
sv: Fel uppstod vid körning av regeluttryck:

source: Two-factor authentication is available, but not configured for this account.
sv: Tvåfaktorsautentisering är tillgänglig men inte konfigurerad för det här kontot.

source: You do not have sufficient privileges to perform this operation; Please refer to the documentation for more details.
sv: Du har inte tillräcklig behörighet att utföra åtgärden. Se dokumentationen för mer information.

source: Data dictionary
sv: Dataordlista

source: Can not find signon authentication script:
sv: Kan inte hitta scriptet för verifiering av inloggning:

source: Enter your siteverify URL for your reCAPTCHA service.
sv: Ange URL:en för siteverify för din reCAPTCHA-tjänst.

source: Group items in the tree
sv: Gruppera objekt i trädet

source: query_cache_limit is set to 1 MiB
sv: query_cache_limit är satt till 1 Mb

source: Show table comments
sv: Visa tabellkommentarer

source: ø Time
sv: ø tid

source: Update query
sv: Uppdatera fråga

source: Global privileges
sv: Globala privilegier

source: Delete tracking data for this version?
sv: Ta bort uppföljningsdata för denna version?

source: An index has been added on %s.
sv: Ett index har lagts till för %s.

source: Customize links shown in SQL Query boxes.
sv: Anpassa länkar som visas i SQL-frågerutor.

source: Binary - do not edit
sv: Binär - ändra inte

source: Query caching method
sv: Frågecache-metod

source: Continue insertion with %s rows
sv: Fortsätt inmatning med %s rader

source: Author
sv: Författare

source: Maximum databases
sv: Maximalt antal databaser

source: Rate of joins without indexes
sv: Andelen JOIN som saknar index

source: Maximum number of favorite tables; set 0 to disable.
sv: Maximalt antal favorittabeller, ange 0 för att inaktivera.

source: Number of rows for CHAR/VARCHAR textareas.
sv: Antal rader för CHAR/VARCHAR textfält.

source: Authentication plugin
sv: Autentiseringsinsticksmodul

source: Save directory
sv: Sparningskatalog

source: Leave blank for no "persistent" recently used tables across sessions, suggested: [kbd]pma__recent[/kbd].
sv: Lämna tomt för att stänga av "ihållande" nyligen använda tabeller över sessioner, förslag: [kbd]pma__recent[/kbd].

source: Click to mark/unmark.
sv: Klicka för att markera/avmarkera.

source: You are trying to reduce the number of rows, but have already entered data in those rows which will be lost. Do you wish to continue?
sv: Du försöker minska antalet rader, men du har redan matat in data i dessa rader som kommer försvinna. Vill du fortsätta?

source: Print
sv: Skriv ut

source: Display servers selection
sv: Visa serverval

source: Displays a link to download this image.
sv: Visar en länk för att ladda ner denna bild.

source: Clients are usually aborted when they did not close their connection to MySQL properly. This can be due to network issues or code not closing a database handler properly. Check your network and code.
sv: Klienter är oftast avslutade när de inte stängde kopplingen till MySQL ordentligt. Detta kan bero på nätverksproblem eller att koden inte stänger databashanteraren korrekt. Kontrollera ditt nätverk och kod.

source: Czech
sv: Tjeckisk

source: Delete tracking data for this table?
sv: Ta bort spårning för denna tabell?

source: October
sv: oktober

source: Limits the number of new connections the user may open per hour.
sv: Begränsar antalet nya förbindelser användaren kan öppna per timme.

source: There already exists a page named "%s" please rename it to something else.
sv: Det finns redan en sida med namnet ”%s”. Byt namn till något annat.

source: Order by
sv: Sortera efter

source: Values
sv: Värden

source: SSL is used
sv: SSL används

source: Delete entry from tracking report?
sv: Ta bort data från spårningsrapport?

source: You have updated the privileges for %s.
sv: Du har uppdaterat privilegierna för %s.

source: Checksum table
sv: Kontrollsumma tabell

source: Do not use AUTO_INCREMENT for zero values
sv: Använd inte AUTO_INCREMENT för nollvärden

source: Theme %s not found!
sv: Tema %s hittades inte!

source: Provides authentication using HOTP and TOTP applications such as FreeOTP, Google Authenticator or Authy.
sv: Tillhandahåller autentisering med HOTP- och TOTP-appar som FreeOTP, Google Authenticator eller Authy.

source: The second step of normalization is complete for table '%1$s'.
sv: Det andra steget av normalisering är klar för register "%1$s".

source: Disable the table maintenance mass operations, like optimizing or repairing the selected tables of a database.
sv: Inaktivera mängdoperationer för tabellunderhåll, som att optimera eller reparera de valda tabellerna i en databas.

source: Show connected replicas
sv: Visa anslutna repliker

source: Detailed profile
sv: Detaljerad profil

source: %% MyISAM key buffer used: %s%%, this value should be above 95%%
sv: %% MyISAM key buffer använt: %s%%, detta värde bör vara större än 95%%

source: Next autoindex
sv: Nästa autoindex

source: Success.
sv: Lyckades.

source: Go back to this page
sv: Gå tillbaka till denna sida

source: Add event
sv: Lägg till händelse

source: long_query_time is currently set to %ds.
sv: long_query_time är för närvarande satt till %ds.

source: Instead of <code>INSERT</code> statements, use:
sv: Istället för <code>INSERT</code>-kommandon, använd:

source: The number of requests to read a row based on a key. If this is high, it is a good indication that your queries and tables are properly indexed.
sv: Antalet efterfrågningar att läsa en rad baserat på en nyckel. Om detta värde är högt är det en bra indikation på att dina frågor och tabeller är riktigt indexerade.

source: For default values, please enter just a single value, without backslash escaping or quotes, using this format: a
sv: För standardvärden, ange endast ett enstaka värde, utan bakåtstreck eller citattecken, enligt formatet: a

source: Authentication type
sv: Autentiseringstyp

source: If you experience any problems please submit a bug report manually.
sv: Skicka en buggrapport manuellt om du upplever några problem.

source: Query cache
sv: Frågecache

source: Intended for storage of IPv6 addresses, as well as IPv4 addresses assuming conventional mapping of IPv4 addresses into IPv6 addresses
sv: Avsedd för lagring av IPv6-adresser samt IPv4-adresser, förutsatt konventionell mappning av IPv4-adresser till IPv6-adresser

source: Add a linestring
sv: Lägg till ny linestring

source: Import monitor configuration
sv: Importera monitorkonfigurationen

source: Thread cache is not efficient.
sv: Trådad cache är inte effektiv.

source: System memory
sv: Systemminne

source: Table options
sv: Tabellalternativ

source: Shows link to [a@https://www.php.net/manual/en/function.phpinfo.php]phpinfo()[/a] output.
sv: Visar en länk till utdata från [a@https://www.php.net/manual/en/function.phpinfo.php]phpinfo()[/a].

source: Select two columns
sv: Välj två kolumner

source: The average time to acquire a row lock, in milliseconds.
sv: Genomsnittlig tid för att skaffa ett radlås, i millisekunder.

source: A point in 2-dimensional space
sv: En punkt i det 2-dimensionella rummet

source: display column
sv: Visa kolumn

source: Documentation
sv: Dokumentation

source: Remember filename template
sv: Kom ihåg filnamnsmall

source: Do you have a group of columns which on combining gives an existing column? For example, if you have first_name, last_name and full_name then combining first_name and last_name gives full_name which is redundant.
sv: Har du en grupp med kolumner som kombinerade ger en befintlig kolumn? Till exempel om du har förnamn/efternamn/full_name, så är full_namn överflödigt.

source: Memory limit
sv: Minnesgräns

source: Link with main panel by highlighting the current database or table.
sv: Länk med huvudpanelen genom att markera den aktuella databasen eller tabellen.

source: Traffic
sv: Trafik

source: As defined:
sv: Som definierat:

source: A variable-length (%s) string, the effective maximum length is subject to the maximum row size
sv: En variabel-längd (%s) sträng, den effektiva maximala längden är förutsättningen för den maximala radstorleken

source: Icons
sv: Ikoner

source: Tracking data manipulation successfully deleted
sv: Spårningsdata manipulation har tagits bort

source: The InnoDB buffer pool has a profound impact on performance for InnoDB tables. Assign all your remaining memory to this buffer. For database servers that use solely InnoDB as storage engine and have no other services (e.g. a web server) running, you may set this as high as 80% of your available memory. If that is not the case, you need to carefully assess the memory consumption of your other services and non-InnoDB-Tables and set this variable accordingly. If it is set too high, your system will start swapping, which decreases performance significantly. See also <a href="https://www.percona.com/blog/2007/11/03/choosing-innodb_buffer_pool_size/">this article</a>
sv: InnoDB-buffertpoolen har stor inverkan på prestandan för InnoDB-tabeller. Tilldela allt återstående minne till bufferten. För databasservrar som enbart använder InnoDB som lagringsmotor och inte kör andra tjänster, till exempel en webbserver, kan du ange upp till 80 % av det tillgängliga minnet. Annars behöver du noga bedöma andra tjänsters och icke-InnoDB-tabellers minnesanvändning och ange variabeln därefter. Om den anges för högt börjar systemet växla minne, vilket försämrar prestandan avsevärt. Se även <a href="https://www.percona.com/blog/2007/11/03/choosing-innodb_buffer_pool_size/">den här artikeln</a>

source: Enclose table and column names with backquotes
sv: Använd citattecken runt tabell- och fältnamn

source: Excel edition:
sv: Excel-version:

source: Edit mode
sv: Redigeringsläge

source: Partitions
sv: Partitioner

source: File upload functionality for TEXT columns. It does not have a textarea for input.
sv: Filuppladdningsfunktion för TEXT-kolumner. Det finns inget textområde för inmatning.

source: Relation view
sv: Relationsvy

source: These functions are meant to return a binary result; to avoid inconsistent results you should store it in a BINARY, VARBINARY, or BLOB column.
sv: De här funktionerna är avsedda att returnera ett binärt resultat. För att undvika inkonsekventa resultat bör du lagra det i en kolumn av typen BINARY, VARBINARY eller BLOB.

source: Stand-in structure for view
sv: Ersättningsstruktur för vy

source: Rows
sv: Rader

source: Replace table prefix
sv: Ersätt tabellprefix

source: Authentication settings.
sv: Autentiseringsinställningar.

source: %1$d column has been dropped successfully.
sv: %1$d kolumn har tagits bort.

source: %1$d columns have been dropped successfully.
sv: %1$d kolumner har tagits bort.

source: Key cache miss calculated as rate of physical reads compared to read requests (calculated value)
sv: Misslyckad nyckelcache beräknas som andelen fysiska läsningar jämfört med läsbegäran (beräknat värde)

source: The file being uploaded is probably larger than the maximum allowed size or this is a known bug in webkit based (Safari, Google Chrome, Arora etc.) browsers.
sv: Filen som laddas upp är förmodligen större än maximalt tillåtna storlek eller så är detta en känd bugg i webkit-baserade webbläsare (Safari, Google Chrome, Arora etc.).

source: Current amount of Questions: %s
sv: Nuvarande antal frågor: %s

source: A fixed-length (0-255, default 1) string that is always right-padded with spaces to the specified length when stored
sv: En sträng med fast längd (0-255, standard 1) som alltid är högerfylld med blankslag till den angivna längden vid lagring

source: Trigger %1$s has been modified.
sv: Triggern %1$s har modifierats.

source: No data to display
sv: Ingen data att visa

source: Show full queries
sv: Visa fullständiga frågor

source: Edit query
sv: Redigera fråga

source: You are not allowed to log in to this MySQL server!
sv: Du har inte befogenhet att logga in till denna MySQL server!

source: Strong
sv: Stark

source: The current query cache hit rate of %s%% is below 20%%
sv: Den aktuella frågecachens träffsäkerhet på %s%% är under 20%%

source: Error text: %s
sv: Felmeddelande: %s

source: Do you have any column which can be split into more than one column? For example: address can be split into street, city, country and zip.
sv: Har du någon kolumn som kan delas upp i mer än en kolumn? Till exempel: adress kan delas in i gata, stad, land och postnummer.

source: Replication resetting successfully.
sv: Replikering återställdes framgångsrikt.

source: This might be a good way to import large files, however it can break transactions.
sv: Det här kan vara ett bra sätt att importera stora filer, men det kan bryta transaktioner.

source: Wrong data
sv: Felaktigt data

source: Switch to copied table
sv: Byt till kopierad tabell

source: You are about to DESTROY a complete table!
sv: Du håller på att FÖRSTÖRA en hel tabell!

source: slow_query_log and general_log are disabled.
sv: slow_query_log och general_log är deaktiverade.

source: Unhide
sv: Visa

source: Create new trigger
sv: Skapa ny trigger

source: Set long_query_time to %d seconds.
sv: Sätt long_query_time till %d sekunder.

source: Foreign key limit
sv: Begränsning för främmande nyckel

source: Table-level tabs
sv: Flikar på tabellnivå

source: Save output to a file
sv: Spara utdata till en fil

source: This usually means there is a syntax error in it, please check any errors shown below.
sv: Detta betyder oftast att det finns ett syntaxfel i den, kontrollera eventuella fel som visas nedan.

source: Save
sv: Spara

source: Error in processing!
sv: Fel i behandlingen!

source: Georgian
sv: Georgisk

source: Replicated
sv: Replikerad

source: The uptime is only %s
sv: Upptid är bara %s

source: You must provide a routine name!
sv: Du måste ange ett rutinnamn!

source: Remember table's sorting
sv: Kom ihåg tabellens sortering

source: "%s" requires %s extension
sv: "%s" kräver tillägget %s

source: Stand in
sv: Stå i

source: Refresh rate
sv: Uppdateringsfrekvens

source: SHA256 password authentication
sv: SHA256 lösenordsautentisering

source: Change login information / Copy user account
sv: Ändra information om inloggning / kopiera användarkonto

source: Deleting
sv: Raderar

source: Formats text as XML with syntax highlighting.
sv: Formaterar text som en XML-fråga med syntaxmarkering.

source: Unknown storage engine.
sv: Okänd lagringsmotor.

source: Unable to use timezone "%1$s" for server %2$d. Please check your configuration setting for [em]$cfg['Servers'][%3$d]['SessionTimeZone'][/em]. phpMyAdmin is currently using the default time zone of the database server.
sv: Det går inte att använda tidszonen "%1$s" för server %2$d. Kontrollera konfigurationsinställningen för [em]$cfg['Servers'][%3$d]['SessionTimeZone'][/em]. phpMyAdmin använder för närvarande databasserverns standardtidszon.

source: Pick
sv: Välj

source: Track table
sv: Spåra tabell

source: Quick
sv: Snabb

source: Error 1045: Access denied for user. Additional error information may be available, but is being hidden by the %s configuration directive.
sv: Fel 1045: Åtkomst nekades för användaren. Ytterligare felinformation kan finnas, men döljs av konfigurationsdirektivet %s.
